app/controllers/home_controller.rb

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 3 LIMIT 1
---
  def index
    if !session[:idUsuario] then
      redirect_to('/login')
    else
      @usuario = Usuario.find(session[:idUsuario])

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`login` = '123' LIMIT 1
---
  def checarLogin

    if Usuario.find_by_login(params['login'])