app/controllers/tarefas_controller.rb

  def index
    @tarefas = Tarefa.all
---
SELECT `tarefas`.* FROM `tarefas`

  def create
    @tarefa = Tarefa.new(tarefa_params)

    respond_to do |format|
      if @tarefa.save
---
INSERT INTO `tarefas` (`texto`, `data`, `usuario_id`, `created_at`, `updated_at`) VALUES ('tarefaTeste', '2015-07-21 00:00:00', 3, '2015-07-21 22:19:32', '2015-07-21 22:19:32')

    def set_tarefa
      @tarefa = Tarefa.find(params[:id])
---
SELECT  `tarefas`.* FROM `tarefas` WHERE `tarefas`.`id` = 2 LIMIT 1