app/controllers/usuarios_controller.rb

SELECT `usuarios`.* FROM `usuarios`
---
  def index
    @usuarios = Usuario.all

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1
---
  def edit
    @usuario = Usuario.find(params[:id])

INSERT INTO `usuarios` (`login`, `senha`, `nome`, `dataNasc`, `email`, `created_at`, `updated_at`) VALUES ('matheusmarrane', '123', 'matheus marrane', '1995-05-08', 'matheus_marrane@gmail.com', '2015-07-01 21:17:15', '2015-07-01 21:17:15')
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`login` = 'doug' LIMIT 1
---
    def set_usuario

      if params[:id].to_i != 0
        @usuario = Usuario.find(params[:id])
      else
        @usuario = Usuario.find_by_login(params[:id])